<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Scout-App GUI SASS processor and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jps3.munki.Scout-App</string>
    <key>Input</key>
    <dict>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Scout-App - The simplest Sass processor http://scout-app.io</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Scout-App</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECEIPE_CACHE_DIR%/%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
