<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Scout-App GUI SASS processor and imports into Munki</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Scout-App</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Scout-App</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>MUNKI_CATEGORY</key>
        <string>Web Development</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>scout-app/scout-app</string>
                <key>asset_regex</key>
                <string>^([Oo][Ss][Xx]|[Mm][Aa][Cc][Oo][Ss])_[Ss]cout[-_][Aa]pp_.*\.zip$</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
