<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <!--

    2017-08-30

    NOTICE of Deprecation

    Does anyone wish to take support of these recipes over (if there is not 
    already a newer, competing set)?
    
    Otherwise I will simply delete this folder from my repo at some point in late
    2017 or early 2018.


    -->
	<key>Description</key>
	<string>Downloads the latest version of Mac Data Recovery Guru from web site, encloses in a DMG file and imports into Munki repository.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.MacDataRecoveryGuru</string>
	<key>Input</key>
	<dict>
		<key>APPNAME</key>
		<string>Mac Data Recovery Guru.app</string>
        <key>MUNKI_REPO_SUBDIRECTORY</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>Mac Data Recovery Guru is the most modern, the most technologically advanced, and the easiest to use mac data recovery software available. http://macosxfilerecovery.com/datarecoveryproducts/data-recovery-guru/</string>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.MacDataRecoveryGuru</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>No longer maintained, please feel free to fork and take over if you use this product.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
	                <key>version</key>
	                <string>%version%</string>
	                <key>unattended_install</key>
	                <true/>
	                <key>unattended_uninstal</key>
	                <true/>
	                <key>blocking_applications</key>
	                <array>
	                    <string>%APPNAME%</string>
	                </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIRECTORY%</string>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
