<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <!--

    2017-08-30

    NOTICE of Deprecation

    Does anyone wish to take support of these recipes over (if there is not 
    already a newer, competing set)?
    
    Otherwise I will simply delete this folder from my repo at some point in late
    2017 or early 2018.


    -->
	<key>Description</key>
	<string>Downloads the latest version of Mac Data Recovery Guru from web site and flat packages.</string>
	<key>Identifier</key>
	<string>com.github.jps3.pkg.MacDataRecoveryGuru</string>
	<key>Input</key>
	<dict>
        <key>APPNAME</key>
        <string>Mac Data Recovery Guru.app</string>
        <key>ID</key>
        <string>com.macosxfilerecovery.datarecoverygurusite.MacDataRecoveryGuru</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.MacDataRecoveryGuru</string>
	<key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%APPNAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>template_path</key>
				<string>PackageInfoTemplate</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
                <key>version</key>
                <string>%version%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>%ID%</string>
					<key>resources</key>
					<string>Resources</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
