<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.jps3.munki.BlurbBookCreatorIndesign</string>
    <key>Input</key>
    <dict>
        <key>APP_VERSION_YEAR</key>
        <string>2023</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>Blurb Book Creator for InDesign</string>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string/>
            <key>developer</key>
            <string>Blurb, Inc.</string>
            <key>category</key>
            <string>Design and Media</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>blocking_applications</key>
            <array>
                <string>Adobe InDesign %APP_VERSION_YEAR%.app</string>
            </array>
            <key>preinstall_script</key>
            <string>#!/bin/bash
# error out for now until script finished
exit 1
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
            </dict>
            <key>Processor</key>
            <string></string>
        </dict>
    </array>
</dict>
</plist>
