<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version Rhinoceros.</string>
		<key>Identifier</key>
		<string>com.github.jps3.download.Rhinoceros</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Rhinoceros</string>
			<key>DOWNLOAD_URL</key>
			<string>http://www.rhino3d.com/download/rhino-for-mac/5.0/wip</string>
			<key>REGISTRANT_EMAIL_ADDRESS</key>
			<string>you@your.co</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>RhinocerosUrlProvider</string>
				<key>Arguments</key>
				<dict>
					<key>download_form_url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>registrant_email</key>
					<string>%REGISTRANT_EMAIL_ADDRESS%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/rhinoceros_registration</string>
					<key>file_content</key>
					<string>%license_code%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
