<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Soulver.app.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Soulver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Soulver</string>
		<key>appcast_url</key>
		<string>http://www.acqualia.com/soulver/appcast/soulver2.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
