<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Repetier 3D printer software as a dmg.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Repetier</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Repetier</string>
        <key>APPNAME</key>
        <string>%NAME%-Host Mac.app</string>
        <key>appcast_url</key>
        <string>https://www.repetier.com/updates/rhm/rhm-appcast.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
	    <dict>
	        <key>Processor</key>
	        <string>SparkleUpdateInfoProvider</string>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
