<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OpenSCAD and imports into Munki</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.OpenSCAD</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenSCAD</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/OpenSCAD</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>OpenSCAD is a software for creating solid 3D CAD models. It is free software and available for Linux/UNIX, Windows and Mac OS X. Unlike most free software for creating 3D models (such as Blender) it does not focus on the artistic aspects of 3D modelling but instead on the CAD aspects. Thus it might be the application you are looking for when you are planning to create 3D models of machine parts but pretty sure is not what you are looking for when you are more interested in creating computer-animated movies. http://openscad.org</string>
			<key>display_name</key>
			<string>OpenSCAD</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>OpenSCAD</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.OpenSCAD</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
