<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Camtasia DMG from the TechSmith web site, and imports into Munki repository. It is assumed that the newest version is the only version on the web page for the application.</string>
    <key>Identifier</key>
    <string>com.github.jps3.munki.Camtasia</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Camtasia</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>DMS/Applications</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>A powerful, yet easy-to-use screen recorder, Camtasia helps you create professional videos without having to be a video pro. Easily record your screen movements and actions, or import HD video from a camera or other source. Customize and edit content on both Mac and Windows platforms, and share your videos with viewers on nearly any device.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
/Applications/Camtasia\ 2023.app/Contents/Resources/aceinstaller install --silent
            </string>
            <!--
                $ "/Applications/Camtasia 2023.app/Contents//Resources/aceinstaller" -h
                aceinstaller: <action>

                    help
                        Display this message.

                    install [-s|—silent]

                        Install (or update) the ACE.driver coreaudiod plugin. The version to be installed must be
                        newer than what is currently installed, and the current system version must be supported.
                        Installing requires root privileges.

                        -s|—silent    Do not generate an error if the version to be installed is not newer than
                                       than the version that is currently installed.

                    uninstall [-s|—silent]

                        Uninstall the ACE.driver coreaudiod plugin. There must be a plugin installed for it to be
                        uninstalled. Uninstalling requires root privileges.

                        —safe         Generate an error and do not uninstall the ACE.driver coreaudiod plugin when
                                       there are other applications using it. This can be combined with the —silent
                                       option to prevent generating an error.

                        -s|—silent    Do not generate an error when an uninstall fails.

                    version
                        Display the installed and installable ACE versions.

              -->
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Camtasia</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
