<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Camtasia DMG from the TechSmith web site. It is assumed that the newest version is the only version on the web page for the application.</string>
    <key>Identifier</key>
    <string>com.github.jps3.download.Camtasia</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Camtasia</string>
        <key>url</key>
        <!--
            2016-02-05T11:44:45-0500
            Tested availability of HTTPS scheme to download. 
            Received Invalid Certificate Chain error.
            Certificate DNS name(s) do not match that of URL.
        -->
        <string>http://download.techsmith.com/camtasiamac/enu/camtasia.dmg</string>
        <key>APPNAME</key>
        <string>%NAME% 2.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>requirement</key>
                <string>identifier "com.techsmith.camtasia2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TQL462TU8"</string>
                <key>input_path</key>
                <string>%pathname%/%APPNAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
