<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This will download the latest Meshmixer installer pkg (via *.download.* parent recipe). It will then extract ONLY the Meshmixer.app from one of the sub-packages, wrap it in a *.dmg file and then import that app-dmg into Munki. (This completely ignores the borked template/demo/supporting file package, which may cause minor warnings from Meshmixer.app when certain menu items selected, but does not break overall application functionality.)</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Meshmixer</string>
	<key>Input</key>
	<dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_DISPLAYNAME</key>
        <string>%NAME%</string>
        <key>MUNKI_DESCRIPTION</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>autoremove</key>
            <true/>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>display_name</key>
            <string>%MUNKI_DISPLAYNAME%</string>
            <key>description</key>
            <string>%MUNKI_DESCRIPTION%</string>
            <key>minimum_os_version</key>
            <string>%minimum_os_version%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>blocking_applications</key>
            <array>
                <string>%NAME%</string>
            </array>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Meshmixer</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>skip_payload</key>
                <false/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_unpacked/com.meshmixer.meshmixer*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkg_payload_path</key>
                <string>%found_filename%/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: Autodesk</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>dmg_megabytes</key>
                <string>115</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
