<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Meshmixer 3D modeler for output to additive manufacturing devices (ie "3D printers").</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Meshmixer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Meshmixer</string>
        <key>updates_url</key>
        <string>http://www.meshmixer.com/current_version.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MeshmixerUrlProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
