<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest stable Arduino and creates flat *.pkg installer.</string>
		<key>Identifier</key>
		<string>com.github.jps3.pkg.Arduino</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Arduino</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>ParentRecipe</key>
		<string>com.github.jps3.download.Arduino</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>bundleid</key>
					<string>cc.arduino.Arduino.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
