<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Arduino and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Arduino</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Arduino</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Arduino</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>dmg_megabytes</key>
                <string>250</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
					<key>description</key>
			        <string>The open-source Arduino environment makes it easy to write code and upload it to the i/o board. It runs on Windows, Mac OS X, and Linux. The environment is written in Java and based on Processing, avr-gcc, and other open source software.</string>			
					<key>display_name</key>
					<string>%NAME%</string>
					<key>name</key>
					<string>%NAME%</string>
					<key>unattended_install</key>
					<true/>
					<key>unattended_uninstall</key>
					<true/>
					<key>blocking_applications</key>
					<array>
						<string>%NAME%</string>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
