<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Arduino and imports into Munki.

For the ARCH_TYPE variable use 64bit for Intel or arm64 for Apple Silicon.</string>
    <key>Identifier</key>
    <string>com.github.jps3.munki.Arduino</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Arduino</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>ARCH_TYPE</key>
        <string>64bit</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The open-source Arduino Software (IDE) makes it easy to write code and upload it to the board. It runs on Windows, Mac OS X, and Linux. The environment is written in Java and based on Processing and other open-source software.

This software can be used with any Arduino board.

Refer to the Getting Started page for Installation instructions:

https://www.arduino.cc/en/Guide/HomePage
            </string>
            <key>display_name</key>
            <string>Arduino IDE</string>
            <key>name</key>
            <string>%NAME%-%ARCH_TYPE%</string>
            <key>supported_architectures</key>
            <array>
                <string>%ARCH_TYPE%</string>
            </array>
            <key>blocking_applications</key>
            <array>
                <string>Arduino IDE</string>
            </array>
			<key>category</key>
			<string>Developer</string>
			<key>developer</key>
			<string>arduino.cc</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Arduino</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
