<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Arduino and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Arduino</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Arduino</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
            <string>The open-source Arduino Software (IDE) makes it easy to write code and upload it to the board. It runs on Windows, Mac OS X, and Linux. The environment is written in Java and based on Processing and other open-source software.
                This software can be used with any Arduino board.
            </string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>blocking_applications</key>
			<array>
				<string>%NAME%</string>
			</array>
			<key>postinstall_script</key>
			<string>#!/bin/bash
PATH=/bin:/usr/sbin

# We need to fix permissions of one or more items embedded within the *.app bundle which, apparently

# https://github.com/arduino/Arduino/issues/4501
chmod 0755 "/Applications/Arduino.app/Contents/Java/hardware/tools/avr/bin/avrdude_bin"

# https://github.com/arduino/Arduino/issues/4273
chmod 0755 "/Applications/Arduino.app/Contents/Java/reference/Edison_help_files"
chmod 0755 "/Applications/Arduino.app/Contents/Java/reference/Galileo_help_files"

# Related:
# https://github.com/arduino/Arduino/issues/3468

# Verify that still passes gatekeeper check
spctl --assess /Applications/Arduino.app || logger -is "$0: spctl --assess /Applications/Arduino.app returned '$?'"
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Arduino</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>dmg_megabytes</key>
                <string>500</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
