<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest drivers for the Wacom Intuos Pro tablets.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.WacomIntuosProTabletDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>WacomIntuosProDriver</string>
        <key>DRIVERS_URL</key>
        <string>https://www.wacom.com/en-us/support/product-support/drivers</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>URLTextSearcher</string>
	        <key>Arguments</key>
	        <dict>
	            <key>url</key>
                <string>%DRIVERS_URL%</string>
	            <key>re_pattern</key>
                <string>(?P&lt;url&gt;https?://.*\.?wacom\.com/.*/drivers?/mac/pro[^/]*/WacomTablet_(?P&lt;version&gt;[\w\d\.-]+)\.dmg)</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
	        </dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
    	<key>Processor</key>
    	<string>CodeSignatureVerifier</string>
    	<key>Arguments</key>
    		<dict>
        	<key>input_path</key>
        	<string>%pathname%/Install Wacom Tablet.pkg</string>
        	<key>expected_authority_names</key>
        	<array>
          	<string>Developer ID Installer: Wacom Technology Corp. (EG27766DY7)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
        	</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
