<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Wacom Intuos Pro Driver and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.WacomIntuosProTabletDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WacomIntuosProDriver</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>drivers</string>
		<key>WACOM_PKG_NAME</key>
		<string>Install Wacom Tablet.pkg</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Drivers and support software for the Wacom Intuos Pro tablets.</string>
		<key>MUNKI_DISPLAYNAME</key>
		<string>WacomIntuosProDriver</string>
		<key>MUNKI_NAME</key>
		<string>%NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.WacomIntuosProTabletDriver</string>
	<key>Process</key>
	<array>
        <!--
 The Wacom software typically comes as a *.pkg enclosed in a *.dmg file. However the sub-pkgs often have items in their Resources folder symlinked to the *.dmg root folder (ex. different language license or "read me" files. This causes issues if the entire *.dmg is not taken as a while, such as if the *.pkg is removed to another *.dmg in the Munki import process.
        -->
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munkiimport_pkgname</key>
                <string>%WACOM_PKG_NAME%</string>
				<key>pkginfo</key>
				<dict>
					<key>name</key>
					<string>%MUNKI_NAME%</string>
					<key>displayname</key>
					<string>%MUNKI_DISPLAYNAME%</string>
					<key>description</key>
					<string>%MUNKI_DESCRIPTION%</string>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
					<key>minimum_os_version</key>
					<string>10.6</string>
					<key>unattended_install</key>
					<true/>
					<key>uninstall_method</key>
					<string>uninstall_script</string>
					<key>uninstall_script</key>
					<string>#!/bin/bash
		PATH=/bin:/sbin:/usr/bin:/usr/sbin
		uninstall_script="/Applications/Wacom Tablet.localized/Wacom Table Utility.app/Contents/Resources/uninstall.pl"
		if [[ -f "$uninstall_script" &amp;&amp; -x "$uninstall_script" ]]; then
			"$uninstall_script"
		else
			logger -is "ERROR: Could not locate uninstall_script: $uninstall_script"
			exit 1
		fi</string>
					<key>notes</key>
					<string>
						- Items staged to /tmp/ from pkg, later moved elsewhere (thus not represented in pkg bom)
							+ /Library/Frameworks/WacomMultiTouch.framework/
							+ /Library/Internet Plug-Ins/WacomTabletPlugin.plugin
						- A binary in one of the support apps creates the following:
							+ /Library/LaunchAgents/com.wacom.wacomtablet.plist
						- By using Wacom's uninstall script (called by this pkginfo's uninstall_script) all should be cleaned up appropriately.
					</string>
				</dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
