<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of gyroflow-ofx and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.jps3.pkg.gyroflow-ofx</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>gyroflow-ofx</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.gyroflow-ofx</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Library/OFX/Plugins</key>
					<string>0755</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/Gyroflow.ofx.bundle</string>
				<key>destination_path</key>
				<string>%pkgroot%/Library/OFX/Plugins/Gyroflow.ofx.bundle</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>xyz.gyroflow.ofx</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Library/OFX</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
						<dict>
							<key>path</key>
							<string>Library/OFX/Plugins</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
