<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version Rhinoceros.</string>
		<key>Identifier</key>
		<string>com.github.jps3.download.Rhinoceros</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Rhinoceros</string>
			<key>SEARCH_URL</key>
            <string>http://www.rhino3d.com/download/rhino-for-mac/5.0/wip</string>
            <key>DOWNLOAD_URL_STUB</key>
            <string>http://files.mcneel.com/Releases/Rhino/5.0/Mac/rhinoceros_wip</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
                    <string>%SEARCH_URL%</string>
                    <key>result_output_var_name</key>
                    <string>build_number</string>
                    <key>re_pattern</key>
                    <string>(5A\d{3,}) \s*|.* change\s+log</string>
				</dict>
            </dict>
			<dict>
				<key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL_STUB%_%build_number%.dmg</string>
                </dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%NAME%.app</string>
					<key>requirement</key>
					<string>identifier "com.mcneel.rhinoceros" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = D6XDM4N99E</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
            </dict>
		</array>
	</dict>
</plist>
