<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Rhinoceros is now a commercially licensed application. These recipes for downloading the Beta/RC binaries are no longer supported. Officially deprecated. Anyone who has licenses can take this over... (Original author has nothing to test with.)</string>
		<key>Identifier</key>
		<string>com.github.jps3.download.Rhinoceros</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Rhinoceros</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
