<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Salute and imports into Munki.</string>
	<key>Input</key>
	<dict>
        <key>IDENTIFIER</key>
	    <string>com.github.lu-mac-admins.munki.Salute</string>
		<key>NAME</key>
		<string>Salute</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Twocanoes/Salute</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Hot Key Three Finger Salute to lock screen in OS X. https://github.com/twocanoes/salute</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
            <key>unattended_uninstall</key>
            <true/>
			<key>blocking_applications</key>
			<array>
				<string>%NAME%</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.lu-mac-admins.download.Salute</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
