<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Vitamin-R 2 as determined by the Sparkle/appcast update XML file (%appcast_url%). Post-EndOfCheckPhase it will unzip the downloaded file and run the Versioner process to get the apps version string information</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.VitaminR</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VitaminR</string>
		<!--
			2016-02-05T12:34:37-0500
			Checked for availability of HTTPS download of Sparkle AppCast URL.
			Invalid certificate chain error.
		-->
		<key>appcast_url</key>
		<string>https://www.publicspace.net/app/vitamin2.xml</string>
		<key>APPNAME</key>
		<string>Vitamin-R 2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
	    <dict>
	        <key>Processor</key>
	        <string>SparkleUpdateInfoProvider</string>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%APPNAME%.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%APPNAME%.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "net.publicspace.dist.vitaminr2" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7Y9KW4ND8W")</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
