<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string></string>
        <key>Identifier</key>
        <string>com.github.jps3.download.SUIDGuardNG</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SUIDGuardNG</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://www.suidguard.com/stories/index.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_PAGE_URL%</string>
                    <key>re_pattern</key>
                    <string>"(?P&lt;url&gt;https://www.suidguard.com/.*/?%NAME%-[^\.]*\.dmg)"</string>
                    <!-- https://www.suidguard.com/downloads/SUIDGuardNG-105.dmg -->
                    <key>re_flags</key>
                    <array>
                        <string>IGNORECASE</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
        </array>
    </dict>
</plist>
