<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>DEPRECATED software. Do not use. Recipe does nothing. Will be removed from repo.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.SUIDGuardNG</string>
	<key>Input</key>
	<dict>
		<key>repo_subdirectory</key>
		<string>apps/SektionEins</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>deprecated</string>
			</array>
			<key>description</key>
			<string>DO NOT USE</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.SUIDGuardNG</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
	</array>
</dict>
</plist>
