<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>DEPRECATED do not use. Will be removed from repo.</string>
        <key>Identifier</key>
        <string>com.github.jps3.download.SUIDGuardNG</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SUIDGuardNG</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://www.suidguard.com/stories/index.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
