<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest installer pkg of pdftk-server.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.pdftk</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>pdftk</string>
        <key>MUNKI_REPO_SUBDIRECTORY</key>
        <string>opt/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>preuninstall_script</key>
            <string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
# Remove items created by pkg postflight/postinstall scripts not in BOMs
[[ -L /usr/local/bin/pdftk ]] &amp;&amp; rm -f /usr/local/bin/pdftk
rm -f "/opt/pdflabs/pdftk/bin/pdftk_uninstall.sh"
exit 0</string>
            <key>postuninstall_script</key>
            <string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
# Remove items created by pkg postflight/postinstall scripts not in BOMs
rmdir -p "/opt/pdflabs/pdftk"
exit 0</string>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.pdftk</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>No longer maintained, please feel free to fork and take over if you use this product.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIRECTORY%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
