<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Pashua DMG from the developer's web site. It is assumed that the newest version is the only version on the web page for the application.

http://www.bluem.net/en/mac/pashua/</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Pashua</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Pashua</string>
        <key>url</key>
        <string>http://www.bluem.net/files/Pashua.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
