<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest FreeCAD.</string>
	<key>Identifier</key>
	<string>com.github.lu-mac-admins.download.FreeCAD</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FreeCAD</string>
		<key>DOWNLOAD_LATEST_URL</key>
		<string>http://sourceforge.net/projects/free-cad/files/latest/download?source=files</string>
		<!--
			TODO: Some key or variable to select whether "stable" or "unstable" (dev) version to be downloaded?
		-->
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_LATEST_URL%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
