<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the i1Diagnostics application, and imports into Munki repository.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.i1Diagnostics</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>i1Diagnostics</string>
        <key>repo_subdirectory</key>
        <string>apps/X-Rite</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>i1Diagnostics allows you to test your X-Rite measurement instrument functionality and update licenses on your device. Use of this application by end users is recommended when problems are experienced with the measurement instrument. i1Diagnostics creates a report which can be sent to X-Rite support for further investigation if problems persist.</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.i1Diagnostics</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>munkiimport_appname</key>
                <string>i1Diagnostics.app</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
