<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the i1Diagnostics application.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.i1Diagnostics</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>i1Diagnostics</string>
        <key>appcast_url</key>
        <string>http://www.xrite.com/Downloads/Autoupdate/i1Diagnostics/Mac/i1Diagnostics_mac_appcast.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <!-- 2014-09-22T22:41:47-0400
             Deactivated until developer updates code signature on application.
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>expected_authority_names</key>
	            <array>
	                <string>Developer ID Application: X-Rite, Incorporated</string>
	                <string>Developer ID Certification Authority</string>
	                <string>Apple Root CA</string>
	            </array>
            </dict>
        </dict>
        -->
	</array>
</dict>
</plist>
