<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the i1Profiler application, and imports into Munki repository.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.i1Profiler</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>i1Profiler</string>
        <key>repo_subdirectory</key>
        <string>apps/X-Rite</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string></string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.i1Profiler</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgtmp</string>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/apptmp</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgtmp/i1ProfilerComponent.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/apptmp/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgtmp</string>
                    <string>%RECIPE_CACHE_DIR%/apptmp</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
