<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the BetterZip.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.BetterZip</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BetterZip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <!-- 2016-02-05T08:42:55-0500 
                        This is a note regarding security issues with Sparkle updates over http, as
                        reported at https://vulnsec.com/2016/osx-apps-vulnerabilities/

                        % curl -LI https://macitbetter.com/BetterZip3.rss
                        curl: (7) Failed to connect to macitbetter.com port 443: Connection refused

                        Will need to test again at a later date and update as required.
                -->
                <key>appcast_url</key>
                <string>http://macitbetter.com/BetterZip3.rss</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.macitbetter.betterzip" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "79RR9LPM2N")</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
