<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the BetterZip and imports into Munki repository.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.BetterZip</string>
	<key>Input</key>
	<dict>
        <key>MUNKI_REPO_SUBDIRECTORY</key>
        <string>%NAME%</string> 
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>The BetterZip Quick Look Generator extends OS X's Quick Look functionality to let you inspect the contents of compressed archives. The currently supported archive formats are: ZIP, RAR, 7-Zip, TAR, TGZ, TBZ, TXZ, GZip, BZip2, ARJ, LZH, ISO, CHM, CAB, CPIO, DEB, RPM, StuffIt's SIT, BinHex, and MacBinary.</string>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.BetterZip</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIRECTORY%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>display_name</key>
                    <string>%NAME%</string>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
