<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>DEPRECATION NOTICE -- Please use https://github.com/autopkg/homebysix-recipes. The Identifier will remain the same, but you will want to update your autopkg repos and any overrides to reflect the change.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Kitematic</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Kitematic</string>
	<key>Process</key>
    <array>
	</array>
</dict>
</plist>
