<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cura 3D printer software as a dmg. From this it extracts Cura.app from the /Cura/ subfolder and copies to a new dmg file by itself.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Cura</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cura</string>
        <key>updates_url</key>
        <string>http://software.ultimaker.com</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%updates_url%</string>
                <key>re_pattern</key>
                <string>href="(?P&lt;download_path&gt;[^"]+(/+current/+)?Cura-(\d+\.?)+-MacOS\.dmg)"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%updates_url%/%download_path%</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%/%NAME%.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
