<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string></string>
  <key>Identifier</key>
  <string>com.github.jps3.download.cura-lulzbot</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>cura-lulzbot</string>
    <key>DOWNLOAD_URL</key>
    <string>https://www.lulzbot.com/learn/tutorials/cura-lulzbot-edition-installation-macos</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.3</string>
  <key>Process</key>
  <array>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>No longer maintained, please feel free to fork and take over if you use this product.</string>
        </dict>
      </dict>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>re_flags</key>
        <array>
          <string>IGNORECASE</string>
        </array>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
        <key>re_pattern</key>
        <string>href="(https?:)?//(download\.lulzbot\.com/Software/cura-lulzbot/mac/cura-lulzbot[_-]\d+\.\d+(\.\d+)?.dmg)"</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://%match%</string>
          </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
