<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Cura 3D printer software as a dmg.</string>
    <key>Identifier</key>
    <string>com.github.jps3.download.Cura</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UltimakerCura</string>
        <key>APP_NAME</key>
        <string>Ultimaker Cura</string><!-- A pox on thy filenames with spaces -->
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>&lt;filename&gt;Ultimaker Cura-([\d\.]+)-Darwin.dmg&lt;/filename&gt;</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://software.ultimaker.com/latest.xml</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://software.ultimaker.com/current/Ultimaker%20Cura-%version%-Darwin.dmg</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%APP_NAME%.app</string>
                <key>requirement</key>
                <string>identifier "nl.ultimaker.cura" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = V4B3JXRRQS</string>
                <key>strict_verification</key>
                <true/>
                <key>deep_verification</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
