<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string></string>
    <key>Identifier</key>
	<string>com.github.jps3.munki.cura-lulzbot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>cura-lulzbot</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
	        <key>description</key>
	        <string></string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.7</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>%NAME%</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.3</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.cura-lulzbot</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_appname</key>
				<string>cura-lulzbot.app</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
