<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cura 3D printer software as a dmg. From this it extracts Cura.app from the /Cura/ subfolder and copies to a new dmg file by itself. This new Cura.app only dmg is then imported into the Munki repository.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Cura</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>UltimakerCura</string>
        <key>APP_NAME</key>
        <string>Ultimaker Cura</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
	        <key>description</key>
            <string>Ultimaker Cura prepares your model for 3D printing. For novices, it makes it easy to get great results. For experts, there are over 200 settings to adjust to your needs. And integration with major software platforms makes 3D printing even simpler. Get more information at: https://ultimaker.com/en/products/ultimaker-cura-software</string>
			<key>display_name</key>
			<string>%APP_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>%APP_NAME%</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Cura</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_appname</key>
				<string>%APP_NAME%.app</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
