<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>[Wednesday; July 22, 2015] - DEPRECATED. Deletion from repo pending. App appears abandoned. No longer used at our site, no need to upkeep these recipes.</string>
	<key>Identifier</key>
	<string>com.github.jps3.pkg.DTerm</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.DTerm</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
