---
Description: "Downloads Topaz Labs’ Sharpen AI and imports into Munki"
Identifier: com.github.jps3.munki.TopazSharpenAI
ParentRecipe: com.github.jps3.download.TopazSharpenAI
MinimumVersion: "2.7.3"

Input:
  NAME: TopazSharpenAI
  DISPLAY_NAME: "Topaz Sharpen AI"
  MUNKI_REPO_SUBDIR: "apps/%NAME%"
  LAST_MODIFIED: "%last_modified%"
  pkginfo:
    name: "%NAME%"
    minimum_os_version: "11.0"
    display_name: "%DISPLAY_NAME%"
    developer: "Topaz Labs"
    category: "Design and Media"
    catalogs:
      - testing
    description: >-
      Naturally sharpen your images with no artifacts. Get jaw-dropping
      results in a wide variety of situations with deep learning models
      trained to shake reduction, focus correction, and blur removal.
    unattended_install: true
    # unattended_uninstall: true

Process:
  # - Processor: MunkiInstallsItemsCreator ?
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pathname%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

#
# TODOs:
#
#   preuninstall_script:
#   ├─● Delete (symlinks to) plugins
#   ╰─● ... ?
#
#   postinstall_script
#   ├─● Adobe CC plugins:
#   ├──┬╴/Library/Application Support/Adobe/Plug-ins/CC/TopazDeNoiseAI
#   │  ╰🡢 /Applications/Topaz DeNoise AI.app/Contents/Resources/PS_Plugins
#   ├──┬🡢 /Applications/Adobe Photoshop 2024/Plug-ins/TopazDeNoiseAI
#   │  ╰─ /Applications/Topaz DeNoise AI.app/Contents/Resources/PS_Plugins
#   ╰─● set mode 0777 Topaz Sharpen AI.app/Contents/Resources/local/tgrc
#
