---
Description: "Downloads Topaz Labs’ GigaPixel AI and imports into Munki"
Identifier: com.github.jps3.munki.TopazGigapixelAI
ParentRecipe: com.github.jps3.download.TopazGigapixelAI
MinimumVersion: "2.7.3"

Input:
  NAME: TopazGigapixelAI
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
      - testing
    description: >-
        Achieve impeccable image quality.
        Scale to almost any size.
        Then, print, display, and share with the world.
    developer: "Topaz Labs"
    category: "Design and Media"
    display_name: "Topaz Gigapixel AI"
    name: '%NAME%'
    unattended_install: true
    preuninstall_script: |-
      #!/bin/bash

      APP_PATH="/Applications/Topaz Photo AI.app"
      MODELS_PATH="${APP_PATH}/Contents/Resources/models"

      /usr/bin/file --mime-type --separator $'\t' "${MODELS_PATH}"/*  \
      | /usr/bin/awk -F $'\t'                                         \
            '$2~/application\/zip/ && $1~/\.tz2?/ { print $1 }'       \
      | /usr/bin/xargs -I@ /bin/rm -fr "@"

      exit 0
Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
