---
Description: "Downloads Topaz Labs’ DeNoise AI and imports into Munki"
Identifier: com.github.jps3.munki.TopazDeNoiseAI
ParentRecipe: com.github.jps3.download.TopazDeNoiseAI
MinimumVersion: "2.7.3"

Input:
  NAME: TopazDeNoiseAI
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
      - testing
    description: >-
      Eliminate noise while recovering real detail to get the
      best possible image quality in your high-ISO and low
      light photos.
    developer: "Topaz Labs"
    category: "Design and Media"
    display_name: "Topaz DeNoise AI"
    name: '%NAME%'
    unattended_install: true
    preuninstall_script: |-
      #!/bin/bash

      APP_PATH="/Applications/Topaz Photo AI.app"
      MODELS_PATH="${APP_PATH}/Contents/Resources/models"

      /usr/bin/file --mime-type --separator $'\t' "${MODELS_PATH}"/*  \
      | /usr/bin/awk -F $'\t'                                         \
            '$2~/application\/zip/ && $1~/\.tz2?/ { print $1 }'       \
      | /usr/bin/xargs -I@ /bin/rm -fr "@"

      exit 0
Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: "This application has been deprecated by the developer."
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
