---
Description: "Downloads Topaz Labs’ Photo AI"
Identifier: com.github.jps3-recipes.munki.topaz-photo-ai
ParentRecipe: com.github.markkenny.autopkg.pkg.topaz-photo-ai
MinimumVersion: "2.3"
Input:
  NAME: TopazPhotoAI
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
      - testing
    description: "Every shot has potential. Make it perfect."
    developer: "Topaz Labs"
    category: "Design and Media"
    display_name: "Topaz Photo AI"
    name: '%NAME%'
    unattended_install: true
    preuninstall_script: |-
      #!/bin/bash

      APP_PATH="/Applications/Topaz Photo AI.app"
      MODELS_PATH="${APP_PATH}/Contents/Resources/models"

      /usr/bin/file --mime-type --separator $'\t' "${MODELS_PATH}"/*  \
      | /usr/bin/awk -F $'\t'                                         \
            '$2~/application\/zip/ && $1~/\.tz2?/ { print $1 }'       \
      | /usr/bin/xargs -I@ /bin/rm -fr "@"

      exit 0
Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
