---
Description: "Downloads Topaz Labs’ DeNoise AI and imports into Munki"
Identifier: com.github.jps3.munki.TopazDeNoiseAI
ParentRecipe: com.github.jps3.download.TopazDeNoiseAI
MinimumVersion: "2.7.3"

Input:
  NAME: TopazDeNoiseAI
  DISPLAY_NAME: "Topaz DeNoise AI"
  MUNKI_REPO_SUBDIR: "apps/%NAME%"
  LAST_MODIFIED: "%last_modified%"
  pkginfo:
    name: "%NAME%"
    minimum_os_version: "11.0"
    display_name: "%DISPLAY_NAME%"
    developer: "Topaz Labs"
    category: "Design and Media"
    catalogs:
      - testing
    description: >-
      Eliminate noise while recovering real detail to get the
      best possible image quality in your high-ISO and low
      light photos.
    unattended_install: true
    # unattended_uninstall: true
    postinstall_script: |
      #!/bin/zsh

      app_name="Topaz DeNoise AI"
      app_resources="/Applications/${app_name}.app/Contents/Resources"

      # Set file permissions
      chmod -R -v -v 0777 "${app_resources}/models/"

      adobe_plugins_srcs=(
       "${app_resources}/PS_Plugins"/*.plugin(N)
      )

      adobe_plugins_dsts=(
       "/Applications/Adobe Photoshop "*"/Plug-ins"(N)
       "/Library/Application Support/Adobe/Plug-ins/CC"(N)
      )

      print "adobe_plugins_srcs=( ${(j:, :)adobe_plugins_srcs} )"
      print "adobe_plugins_dsts=( ${(j:, :)adobe_plugins_dsts} )"

      for plugin_dst in $adobe_plugins_dsts; do
       if [[ -d "$plugin_dst" ]]; then
         for plugin_src in $adobe_plugins_srcs; do
           printf 'Copying "%s" to "%s" ... ' "$plugin_src" "$plugin_dst"
           cp -Rp "${plugin_src}" "${plugin_dst}/" && print "done." || print "error?"
         done
       fi
      done

      exit 0

Process:
  # - Processor: MunkiInstallsItemsCreator ?
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"

#
# TODOs:
#
#   postinstall_script:
#   ├─● Adobe CC plugins:
#   ├─┬🡢 /Library/Application Support/Adobe/Plug-ins/CC/TopazDeNoiseAI@
#   │ ╰─🡢 /Applications/Topaz DeNoise AI.app/Contents/Resources/PS_Plugins
#   ├─┬🡢 /Applications/Adobe Photoshop 2024/Plug-ins/TopazDeNoiseAI
#   │ ╰─🡢 /Applications/Topaz DeNoise AI.app/Contents/Resources/PS_Plugins@
#   ╰─● ? set mode 0777 Topaz DeNoise AI.app/Contents/Resources/local/tgrc ?
#
#   preuninstall_script:
#   ├─┬─● Remove (symlinks to) plugins
#   │ ╰─┬🡢 /Applications/Topaz DeNoise AI.app/Contents/Resources/PS_Plugins@
#   │   ╰─🡢 ...?
#   │   ╰─🡢 ...?
#   ╰─● ... ?
#
