<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of fseventer, packages and imports into Munki repo. For more information about this application, see: http://www.fernlightning.com/doku.php?id=software:fseventer:start</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.fseventer</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIRECTORY</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>description</key>
			<string>fseventer is a GUI application that: (1) observes filesystem changes using the same underlying API as Spotlight; (2) provides a graphical representation of the file activity; (3) can be used to determine what files are changed via software installation, preferences, etc; (4) requires admin privileges to run.</string>
			<key>preuninstall_script</key>
			<string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
# On first run of fseventer.app, it creates or installs:
# 	(1) /Library/LaunchDaemons/com.fernlightning.fseventer.plist
# 	(2) /Library/PrivilegedHelperTools/com.fernlightning.fseventer
launchd_plist="com.fernlightning.fseventer.plist"
launchd_plist_path="/Library/LaunchDaemons/${launchd_plist}"
privhelper="com.fernlightning.fseventer"
privhelper_path="/Library/PrivilegedHelperTools/${privhelper}"
if [[ -s "$launchd_plist_path" ]]; then
	logger -is "munki preuninstall_script: unloading $launchd_plist_path"
	launchctl unload "$launchd_plist_path"
	sleep 2
	logger -is "munki preuninstall_script: deleting $launchd_plist_path"
	[[ -f "$launchd_plist_path" ]] &amp;&amp; rm -f "$launchd_plist_path"
fi
if [[ -s "$privhelper_path" ]]; then
	if (ps axwwww -o command | grep -wq "$privhelper_path"); then
		logger -is "munki preuninstall_script: killing process $privhelper"
		killall -HUP "$privhelper"
		sleep 2
		killall -9 "$privhelper"
	fi
	logger -is "munki preuninstall_script: deleting $privhelper_path"
	[[ -f "$privhelper_path" ]] &amp;&amp; rm -f "$privhelper_path"
fi
exit 0
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.pkg.fseventer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
					<key>display_name</key>
					<string>%NAME%</string>
					<key>unattended_install</key>
					<true/>
					<key>unattended_uninstall</key>
					<true/>
					<key>blocking_applications</key>
					<array>
						<string>%NAME%</string>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/%NAME%.app</string>					
				</array>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
        <dict>
            <!-- Temporarily disabling Munki Import until I can figure out why it keeps importing the same package adding __1 __2 etc... -->
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
<!--
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIRECTORY%</string>
			</dict>
		</dict>
-->
	</array>
</dict>
</plist>
