<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of fseventer. For more information about this application, see: http://www.fernlightning.com/doku.php?id=software:fseventer:start</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.fseventer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>fseventer</string>
        <!-- 2016-02-05T08:56:01-0500
		        This is a note regarding security issues with Sparkle updates over http, as
		        reported at https://vulnsec.com/2016/osx-apps-vulnerabilities/

		        % curl -LI https://www.fernLightning.com/appcasts/fseventer.xml
		        curl: (7) Failed to connect to www.fernLightning.com port 443: Operation timed out

		        NOTE: Site has notice indicating it has been "temporarily" offline since 7-Jul-2015.
		              What is best practice to deprecate AutoPkg recipes for dead software?
		-->
        <key>SU_URL</key>
        <string>http://www.fernlightning.com/appcasts/fseventer.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
				<key>appcast_url</key>
				<string>%SU_URL%</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/**/fseventer.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
