<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>The recipes for BetterZipQL are deprecated as of 8-Jun-2015. The developer has merged the QuickLook functionality into their BetterZip.app. New AutoPkg recipe(s) for BetterZip will be made available as soon as possible.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.BetterZipQL</string>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.BetterZipQL</string>
	<key>Process</key>
	<array>
	</array>
</dict>
</plist>
