<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist
  PUBLIC '-//Apple//DTD PLIST 1.0//EN'
  'http://www.apple.com/DTDs/PropertyList-1.0.dtd'>
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Slic3r 3D printer software as a dmg.</string>
    <key>Identifier</key>
    <string>com.github.jps3.download.Slic3r</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Slic3r</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>Process</key>
    <array>
	  <dict>
	    <key>Processor</key>
		<string>GitHubReleasesInfoProvider</string>
		<key>Arguments</key>
		<dict>
		  <key>github_repo</key>
		  <string>slic3r/Slic3r</string>
		  <key>asset_regex</key>
		  <string>^[Ss]lic3r-.*\.dmg$</string>
		</dict>
	  </dict>
	  <dict>
	    <key>Processor</key>
		<string>CURLDownloader</string>
	  </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%pathname%/Slic3r.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleVersion</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>This appears to be abandonware. Last release was 2018-05-10 (See https://slic3r.org/releases/1.3.0/)</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
