<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>munkis the latest version of Slic3r 3D printer software as a dmg.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Slic3r</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slic3r</string>
        <key>munki_PAGE</key>
        <string>http://dl.slic3r.org/mac</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
	        <string>Slic3r is the tool you need to convert a digital 3D model into printing instructions for your 3D printer. It cuts the model into horizontal slices (layers), generates toolpaths to fill them and calculates the amount of material to be extruded.</string>			
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>%NAME%</string>
			</array>
			<key>version</key>
			<string>%version%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Slic3r</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
