<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Slic3r 3D printer software as a dmg.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Slic3r</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slic3r</string>
        <key>DOWNLOAD_PAGE</key>
        <string>http://dl.slic3r.org/mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE%</string>
				<key>re_pattern</key>
                <string>href="[^"]*/?(%NAME%-osx-[^"]+-?stable\.dmg)"</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
			</dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE%/%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
