<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TotalTerminal, and extracts the pkg installer from the dmg.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.TotalTerminal</string>
	<key>Input</key>
	<dict>
        <key>MUNKI_REPO_SUBDIRECTORY</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_MIN_OS_VERSION</key>
        <string>10.7</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>TotalTerminal is a plugin for Terminal.app. It provides persistent Visor Window which slides down when you press a hot-key.</string>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.TotalTerminal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%MUNKI_MIN_OS_VERSION%</string>
                    <key>unattended_install</key>
                    <true/>
                    <key>unattended_uninstall</key>
                    <true/>
                    <key>blocking_applications</key>
                    <array>
                        <string>%NAME%</string>
                        <string>Terminal</string>
                        <string>TotalTerminalCrashWatcher</string>
                    </array>
                </dict>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_expanded</string>
                <key>flat_pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_expanded/%NAME%_Plugin.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/%NAME%.app</string>
                    <string>/Library/ScriptingAdditions/%NAME%.osax</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIRECTORY%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_expanded</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_unpacked</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
