<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TotalTerminal, and extracts the pkg installer from the dmg.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.TotalTerminal</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TotalTerminal</string>
		<!-- 
			2016-02-05T11:27:53-0500

			This is a note regarding security issues with Sparkle updates over http, as reported at:
			https://vulnsec.com/2016/osx-apps-vulnerabilities/

			When attempting to use 'https' in %appcast_url%, an Invalid Certificate Chain
			error is returned.

			Will have to revisit and test for https at a later date.
		-->
        <key>APPCAST_URL</key>
        <string>https://updates.binaryage.com/totalterminal.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%APPCAST_URL%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/%NAME%.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pkg_path%</string>
				<key>expected_authority_names</key>
				<array>
				    <string>Developer ID Installer: BinaryAge Limited</string>
				    <string>Developer ID Certification Authority</string>
				    <string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
