<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.jps3.munki.InVesalius</string>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.InVesalius</string>
	<key>Description</key>
    <string>***FINAL DEPRECATION NOTICE 19-Nov-2017***
        
        ***DEPRECATION NOTICE 27-Sep-2017***
~~My clients who had been using this app are no longer with my organization, and no one else is making use of this application. I will be deprecating support of these recipes. If anyone would like to take over, please notify me via Github (submit new issue, or otherwise).~~

~~Downloads the latest version of InVesalius for OS X from developer's web site. (Note: The URL returned has historically used the 'ftp' scheme, which with autopkg effectively causes it to download _every_ time, and the *.dmg's file size is typically ~300MB.)~~
    </string>
	<key>Input</key>
	<dict>
		<key>repo_subdirectory</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>%NAME%</string>
            <key>description</key>
            <string>***FINAL DEPRECATION NOTICE***</string>
		</dict>
	</dict>
	<key>Process</key>
    <array>
        <!--
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%dmg_filename%/invesalius.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/invesalius.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistEditor</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/invesalius.app/Contents/Info.plist</string>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/invesalius.app/Contents/Info.plist</string>
				<key>plist_data</key>
				<dict>
					<key>CFBundleVersion</key>
					<string>%version%</string>
					<key>CFBundleShortVersionString</key>
					<string>%version%</string>
					<key>LSMinimumSystemVersion</key>
					<string>10.6</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
    </array>
    -->
</dict>
</plist>
