<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Fritzing and imports into Munki</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.Fritzing</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fritzing</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Fritzing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.Fritzing</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
					<key>description</key>
					<string>Fritzing is an open-source hardware initiative that makes electronics accessible as a creative material for anyone. We offer a software tool, a community website and services in the spirit of Processing and Arduino, fostering a creative ecosystem that allows users to document their prototypes, share them with others, teach electronics in a classroom, and layout and manufacture professional pcbs. http://fritzing.org/</string>
					<key>display_name</key>
					<string>Fritzing</string>
					<key>name</key>
					<string>%NAME%</string>
					<key>unattended_install</key>
					<true/>
					<key>blocking_applications</key>
					<array>
						<string>Fritzing</string>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
