<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Fritzing binary.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Fritzing</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fritzing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(?P&lt;urlpath&gt;\/download\/(?P&lt;version&gt;[\d\.\w]+)\/mac-os-x-105\/Fritzing[\d\.\w]+\.dmg)"</string>
				<key>url</key>
				<string>http://fritzing.org/download/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://fritzing.org%urlpath%</string>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
