<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <!--

    2017-08-30

    NOTICE of Deprecation

    Does anyone wish to take support of these recipes over? I no longer support any
    workstations doing color-critical work (or anyone who even understands basic
    color management).

    Otherwise I will simply delete this folder from my repo at some point in late
    2017 or early 2018.


    -->
	<key>Description</key>
	<string>Downloads the latest version of BabelColor CT&amp;A application.</string>
	<key>Identifier</key>
	<string>com.github.jps3.pkg.BabelColorCTA</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BabelColorCTA</string>
		<key>APPNAME</key>
		<string>CT&amp;A.app</string>
		<key>APPPATH</key>
		<string>BabelColor CT&amp;A/%APPNAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.BabelColorCTA</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/</string>
			</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pkgroot%/Applications/%APPPATH%/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>com.babelcolor.BabelColorCTA</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>BabelColorCTA_Scripts</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Applications</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
