<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <!--

    2017-08-30

    NOTICE of Deprecation

    Does anyone wish to take support of these recipes over? I no longer support any
    workstations doing color-critical work (or anyone who even understands basic
    color management).

    Otherwise I will simply delete this folder from my repo at some point in late
    2017 or early 2018.


    -->
	<key>Description</key>
	<string>Downloads the latest version of BabelColor CT&amp;A (Intel) application.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.BabelColorCTA</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BabelColorCTA</string>
		<!-- 
			2016-03-24T14:49:29-0400
			No HTTPS available for download.
		-->
        <key>url_stub</key>
        <string>http://www.babelcolor.com/</string>
        <key>url</key>
        <string>http://www.babelcolor.com/download.htm</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>result_output_var_name</key>
				<string>download_url</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Macintosh</string>
				</dict>
				<key>re_pattern</key>
				<!-- index_htm_files/CTA_OS_X_50.zip -->
				<string>href="(.*/CTA_OS_X[^\.]*\.zip)"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url_stub%/%download_url%</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Macintosh</string>
				</dict>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
