<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of BabelColor CT&amp;A (Intel) application.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.BabelColorCTA</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BabelColorCTA</string>
		<!-- 
			2016-03-24T14:49:29-0400
			No HTTPS available for download.
		-->
        <key>url</key>
        <string>http://www.babelcolor.com/index_htm_files/CTA_OS_X.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Macintosh</string>
				</dict>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
