<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable VueScan and creates flat *.pkg installer.</string>
	<key>Identifier</key>
	<string>com.github.jps3.pkg.VueScan</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VueScan</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
    <string>com.github.hansen-m.download.VueScan</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.hamrick.vuescan" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5D5BXT9KP5"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>template_path</key>
				<string>PackageInfoTemplate</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>com.hamrick.vuescan.VueScan.pkg</string>
					<key>resources</key>
					<string>Resources</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
