<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of BlockBlock persistent OS component install monitor.</string>
        <key>Identifier</key>
        <string>com.github.jps3.download.BlockBlock</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>BlockBlock</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://objective-see.com/products/blockblock.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_PAGE_URL%</string>
                    <key>re_pattern</key>
                    <string>"(?P&lt;url&gt;https://bitbucket.org/objective-see/deploy/downloads/%NAME%.*\.zip)"</string>
                    <!-- https://bitbucket.org/objective-see/deploy/downloads/BlockBlock_0.9.3.zip -->
                    <!-- So, how can we check digest signatures against what's downloaded "easily" -->
                    <key>re_flags</key>
                    <array>
                        <string>IGNORECASE</string>
                    </array>
                    <key>curl_opts</key>
                    <array>
                        <string>--compress</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%found_filename%</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.objectiveSee.BlockBlock" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VBG97UB4TA)</string>
                    <!-- See notice on Objective-See web site regarding (temp) signing certs. As of this date and time, I saved to the Wayback Machine, you can see the notice at: https://web.archive.org/web/20171009164747/https://objective-see.com/products/blockblock.html -->
                    <key>strict_verification</key>
                    <true />
                </dict>
            </dict>
        </array>
    </dict>
</plist>
