<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Objective-See’s Ostiarius with VirusTotal integration.</string>
        <key>Identifier</key>
        <string>com.github.jps3.download.Ostiarius</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Ostiarius</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://objective-see.com/products/ostiarius.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_PAGE_URL%</string>
                    <key>re_pattern</key>
                    <string>"(?P&lt;url&gt;https://bitbucket.org/objective-see/deploy/downloads/%NAME%.*\.zip)"</string>
                    <!-- So, how can we check digest signatures against what's downloaded "easily" -->
                    <key>re_flags</key>
                    <array>
                        <string>IGNORECASE</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>purge_destination</key>
                    <true/>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.objectiveSee.Ostiarius" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VBG97UB4TA)</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
