<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Objective-See’s OverSight and imports into Munki repository</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.OverSight</string>
	<key>Input</key>
	<dict>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>%NAME%.app</string>
				<string>%NAME%</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Mac malware often spies on users by recording audio and video sessions...sometimes in an undetected manner.
OverSight monitors a mac's mic and webcam, alerting the user when the internal mic is activated, or whenever a process accesses the webcam

https://objective-see.com/products/oversight.html

Installation script is based on command-line installation instructions at the above URL.
			</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

PATH=/bin:/sbin:/usr/bin:/usr/sbin

OSI="/Applications/OverSight_Installer.app"

#
# Since Munki will handle the installation of the Oversight application 
# via command line (per developer instructions on product web page),
# it would seem to be a good idea to hide the OverSight_Installer.app
# so any client machines which have a local administrator do not use
# (or delete) it manually while it is still a managed or optional
# install.
#

chflags hidden ${OSI}

#
# Perform the installation per developer instructions.
#

${OSI}/Contents/MacOS/OverSight_Installer -install

			</string>
			<key>preuninstall_script</key>
			<string>#!/bin/bash

PATH=/bin:/sbin:/usr/bin:/usr/sbin

OSI="/Applications/OverSight_Installer.app"

#
# Go ahead and unhide the application
#

chflags hidden ${OSI}

#
# Perform the uninstallation per developer instructions.
#

${OSI}/Contents/MacOS/OverSight_Installer -uninstall

			</string>
		</dict>
		<key>repo_subdirectory</key>
		<string>apps/Objective-See</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.3</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.OverSight</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%_Installer.app/Contents/Resources/%NAME%.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%_Installer.app/Contents/Resources/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
