<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest NVIDIA CUDA driver for Mac from the NVDIA web site, and imports into Munki repo. PLEASE NOTE: This package, while recommended by some vendors, such as Adobe for After Effects, is not signed. Neither is any of the software being installed, which is mostly system-level (ex. kexts or Extensions, Frameworks, and libraries). The installer pkg is also served over HTTP. It is pretty much a trifecta of security fail. But... for many situations until NVIDIA fixes this, it is all we have to work with. (Name 'em and shame 'em!)</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.NvidiaCudaDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NvidiaCudaDriver</string>
        <key>repo_subdirectory</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>displayname</key>
            <string>NVIDIA CUDA Driver for Mac</string>
            <key>description</key>
            <string>Supports all NVIDIA products available on Mac hardware. 
From http://www.nvidia.com/object/mac-driver-archive.html

(PLEASE NOTE: NVIDIA does not provide any means currently to verify the integrity of the downloaded software, the installer package or any of the software installed. Additionally it is provided solely via unsecured and unverifiable HTTP connections. Unless you absolutely must use this software, it is recommended that you do NOT install it unti such time as NVIDIA rectifies these important issues.)</string>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.NvidiaCudaDriver</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%destination_path%</string>
                <key>pkginfo</key>
                <dict>
		            <key>version</key>
		            <string>%version%</string>
                </dict>
            </dict>
		</dict>
	</array>
</dict>
</plist>
