<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest NVIDIA CUDA driver for Mac from the NVDIA web site.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.NvidiaCudaDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NvidiaCudaDriver</string>
		<key>download_page_url</key>
		<string>https://www.nvidia.com/object/cuda-mac-driver.html</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Nvidia CUDA 10.2 (toolkit and driver) was the last release to support macOS. Details:
	- https://docs.nvidia.com/cuda/archive/10.2/cuda-toolkit-release-notes/index.html#title-new-features
	- https://mjtsai.com/blog/2019/11/25/nvidia-drops-cuda-support-for-macos/
	- https://gizmodo.com/apple-and-nvidia-are-over-1840015246
				</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%download_page_url%</string>
				<key>re_pattern</key>
				<string>"(?P&lt;url&gt;//.*\.nvidia\.com/Mac/.+/cudadriver[-_](?P&lt;version&gt;[\d\.]+)[-_]macos\.dmg)"</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/CUDADriver.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: NVIDIA Corporation (6KR3T733EC)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
