<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads SketchUp Pro 2014 by looking for the first match on the download page, and imports into Munki repository.

You can specify LOCALE (default: en) for alternative languages. At last check locales were: en, de, es, fr, it, ja, ko.

Note: It sppears that every major release is done annually and requires and updated license. You will want to keep that in mind if you are automating your deployments without testing!</string>
    <key>Identifier</key>
    <string>com.github.jps3.munki.SketchUpPro</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%MUNKI_NAME%</string>
        <key>MUNKI_DISPLAY_NAME</key>
        <string>%MUNKI_NAME%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.pkg.SketchUpPro</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/%SU_FOLDER%/SketchUp.app</string>
                    <string>/Applications/%SU_FOLDER%/Layout.app</string>
                    <string>/Applications/%SU_FOLDER%/Style Builder.app</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict/>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>testing</string>
                    </array>
                    <key>description</key>
                    <string>SketchUp Pro is the most intuitive way to design, document and communicate your ideas in 3D. http://www.sketchup.com/products/sketchup-pro</string>
                    <key>display_name</key>
                    <string>%MUNKI_DISPLAY_NAME%</string>
                    <key>name</key>
                    <string>%MUNKI_NAME%</string>
                    <key>unattended_install</key>
                    <true/>
                    <key>unattended_uninstall</key>
                    <true/>
                    <key>blocking_applications</key>
                    <array>
                        <string>SketchUp.app</string>
                        <string>Style Builder.app</string>
                        <string>Layout.app</string>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
