<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SketchUp Pro by looking for the first match on the download page, then imports into your Munki repo. 
		
You can specify LOCALE (default: en) for alternative languages. At last check locales were: en, de, es, fr, it, ja, ko.

Note (20-Mar-2018): The previous functionality of this recipe which attempted to allow for easy configuration of which "RELEASE_YEAR" version to download and process was not working well due to the not-quite-straightforward way the developer creates their URL patterns. For the time being that functionality has been reverted such that RELEASE_YEAR is used as a convenience variable to limit the number of locations you would need to edit in your overrides. (You will need to update or recreate your RecipeOverride(s) for these changes to take effect for you.

Note (21-Mar-2018): If you encounter any errors in AutoPkg with these recipes, I recommend: (a) recreate your override(s); (b) rename or delete the cached downloads as that has cleared up the majority of hdiutil-related errors for me. Whether you save your receipts or not is up to your conscience and accountant.
</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.SketchUpPro</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development</string>
			</array>
			<key>description</key>
			<string>SketchUp Pro is the most intuitive way to design, document and communicate your ideas in 3D.
Additional information can be found at https://www.sketchup.com/products/sketchup-pro
			</string>
			<key>display_name</key>
			<string>SketchUp Pro</string>
			<key>developer</key>
			<string>Trimble Inc.</string>
			<key>name</key>
			<string>%NAME%%RELEASE_YEAR%</string>
			<key>minimum_os_version</key>
			<string>10.11</string>
			<key>blocking_applications</key>
			<array>
				<string>SketchUp</string>
				<string>Style Builder</string>
				<string>Layout</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.SketchUpPro</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe has been deprecated given the changes to SketchUp over the last few years not reflected herein. I am investigating a way to create a more flexible replacement set of recipes, if possible. (See also the NOTES.md file in this folder.)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%SU_FOLDER%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%SU_FOLDER%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%SU_FOLDER%/SketchUp.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/%SU_FOLDER%/SketchUp.app</string>
					<string>/Applications/%SU_FOLDER%/Layout.app</string>
					<string>/Applications/%SU_FOLDER%/Style Builder.app</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict/>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_appname</key>
				<string>%SU_FOLDER%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot/Applications</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
