<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the QuickLookCSV ql plugin.</string>
	<key>Identifier</key>
	<string>com.github.jps3.pkg.QuickLookCSV</string>
	<key>Input</key>
	<dict>
		<key>ID</key>
		<string>com.google.code.quicklookcsv</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.QuickLookCSV</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>No longer maintained, please feel free to fork and take over if you use this product.</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/QuickLook</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%NAME%.qlgenerator</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/QuickLook/%NAME%.qlgenerator</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>%ID%</string>
                    <key>resources</key>
                    <string>Resources</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/Library/QuickLook</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
	</array>
</dict>
</plist>
