<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the QuickLookCSV ql plugin.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.QuickLookCSV</string>
	<key>Input</key>
	<dict>
        <key>MUNKI_REPO_SUBDIRECTORY</key>
        <string>plugins/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>A QuickLook plugin to quick look CSV files for Mac OS X 10.5+</string>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>com.github.jps3.download.QuickLookCSV</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>No longer maintained, please feel free to fork and take over if you use this product.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
		            <key>unattended_install</key>
		            <true/>
		            <key>unattended_uninstall</key>
		            <true/>
		            <key>postinstall_script</key>
		            <string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
console_uid="$(stat -f "%u" /dev/console)"
if [[ -n "$console_uid" &amp;&amp; $console_uid -ne 0 ]]; then
    console_user="$(id -un $console_uid)"
    sudo -u $console_user /usr/bin/qlmanage -r
fi
exit 0
		            </string>
		            <key>postuninstall_script</key>
		            <string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
console_uid="$(stat -f "%u" /dev/console)"
if [[ -n "$console_uid" &amp;&amp; $console_uid -ne 0 ]]; then
    console_user="$(id -un $console_uid)"
    sudo -u $console_user /usr/bin/qlmanage -r
fi
exit 0
		            </string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIRECTORY%</string>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--itemname=%NAME%.qlgenerator</string>
                    <string>--destinationpath=/Library/QuickLook</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
