<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>THIS RECIPE IS DEPRECATED. Developer changed format of packaging, which these recipes no longer worked for. Please choose one of the other fine alternatives.</string>
	<key>Identifier</key>
	<string>com.github.jps3.munki.SuspiciousPackageQLP</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SuspiciousPackageQLP</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.2</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.SuspiciousPackageQLP</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
