<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>THIS RECIPE IS DEPRECATED. Developer changed format of packaging, which these recipes no longer worked for. Please choose one of the other fine alternatives.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.SuspiciousPackageQLP</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SuspiciousPackageQLP</string>
		<key>pkg_url</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
    		<string>DeprecationWarning</string>
    		<key>Arguments</key>
    		<dict>
    			<key>warning_message</key>
    			<string>No longer maintained, please feel free to fork and take over if you use this product.</string>
    		</dict>
    	</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
