<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Attempts to download the latest version of Übersicht.app (aka Uebersicht), and import into a Munki repository.</string>
	<key>Identifier</key>
    <string>com.github.jps3.munki.Uebersicht</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>Uebersicht</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>displayname</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>Übersicht lets you run system commands and display their output on your desktop in little containers, called widgets. Widgets are written using HTML5, which means they: (1) are easy to write and customize; (2) can show data in tables, charts, graphs ... you name it; (3) can react to different screen sizes. Widgets are written in CoffeeScript or plain JavaScript.  [Think of this as a good replacement for GeekTool -Ed]
http://tracesof.net/uebersicht/</string>
            <key>blocking_apps</key>
            <array>
                <string>Übersicht</string>
                <string>&#220;bersicht</string>
            </array>
        </dict>
	</dict>
	<key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jps3.download.Uebersicht</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
