<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Attempts to download the latest version of Übersicht.app (aka Uebersicht).</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.Uebersicht</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>Uebersicht</string>
        <key>DOWNLOAD_PAGE_URL</key>
        <string>http://tracesof.net/uebersicht/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE_URL%</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>re_pattern</key>
                <string>href=&quot;(.*%NAME%.*\.zip)&quot;</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>requirement</key>
                <string>anchor apple generic and identifier "tracesOf.Uebersicht" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S3P44NRLCW)</string>
                <key>input_path</key>
                <string>%found_filename%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
