<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest PathFinder.</string>
    <key>Identifier</key>
    <string>com.github.jps3.download.PathFinder</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PathFinder</string>
        <key>UPDATE_XML_HOST</key>
        <!--
            2016-02-05T12:16:56-0500
            There does not appear to be a valid HTTPS update URL available.
        -->
        <string>http://sparkle.cocoatech.com</string>
        <key>UPDATE_XML_PATH</key>
        <string>PF7.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PathFinderURLProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Path Finder.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.cocoatech.PathFinder" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MQ76M469AB)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
