<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest PathFinder.</string>
	<key>Identifier</key>
	<string>com.github.jps3.download.PathFinder</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PathFinder</string>
		<key>UPDATE_XML_HOST</key>
		<string>http://sparkle.cocoatech.com</string>
		<key>UPDATE_XML_PATH</key>
		<string>PF6_LION.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>PathFinderURLProvider</string>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
	</array>
</dict>
</plist>
